src/cf/Enums/уатТипыГеосервисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыГеосервисов</Name>
			<Comment>Типы геосервисов (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Картография</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Геокодирование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостроениеМаршрутов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодсказкиАдресов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостроениеМаршрутовЖД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Навигация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маршрутизация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатУчетныеЗаписиСервисовГеоданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатУчетныеЗаписиСервисовГеоданных</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСервиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыГеосервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКлючИнтеграции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийХешИнтеграции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогированиеЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/уатНастройкиЭлектронныхКарт/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Маршрутизация.Видимость = уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП();
	
	ПолучитьНастройкиКартографииМаршрутизации();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПостроениеМаршрутов_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Геокодирование_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиАдресов_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Картография_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Навигация_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура Маршрутизация_ИспользованиеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура Картография_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование, ТипСервиса, ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Картография"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Геокодирование_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Геокодирование"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПодсказкиАдресов_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПодсказкиАдресов"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПостроениеМаршрутов_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутов")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутов"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПостроениеМаршрутовЖД_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.ПостроениеМаршрутовЖД"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.OSM")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Навигация_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема", 
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Навигация")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Навигация"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс")); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Маршрутизация_УчетнаяЗаписьСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
 
	ЭлементыОтбора = Новый Структура("Наименование,ТипСервиса,ВнешняяСистема,ТипАвторизации",
	Строка(ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Маршрутизация")),
	ПредопределенноеЗначение("Перечисление.уатТипыГеосервисов.Маршрутизация"),
	ПредопределенноеЗначение("Справочник.уатВнешниеСистемы.Яндекс"),
	"OAuth-токен"); 
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Справочник.уатУчетныеЗаписиСервисовГеоданных.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	СохранитьНастройкиКартографииМаршрутизации();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройкиКартографииМаршрутизации();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьНастройкиКартографииМаршрутизации()
	
	СтруктураНастроек = уатЭлектронныеКартыСервер.ПолучитьНастройкиСервераКартографииМаршрутизации();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиКартографииМаршрутизации()
	
	СтруктураНастроек = уатЭлектронныеКартыСервер.НастройкиСервераКартографииМаршрутизацииПоУмолчанию();
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, ЭтотОбъект);
	уатЭлектронныеКартыСервер.СохранитьНастройкиСервераКартографииМаршрутизации(СтруктураНастроек);
		
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаКартография.Доступность              = Картография_Использование;
	Элементы.ГруппаГеокодирование.Доступность           = Геокодирование_Использование;
	Элементы.ГруппаПостроениеМаршрутов.Доступность      = ПостроениеМаршрутов_Использование;
	Элементы.ГруппаНавигация.Доступность                = Навигация_Использование;
	Элементы.ГруппаМаршрутизация.Доступность            = Маршрутизация_Использование;
	Элементы.ГруппаПостроениеМаршрутовЖД.Доступность    = ПостроениеМаршрутовЖД_Использование;
	
	Элементы.ПодсказкиАдресов_УчетнаяЗапись.Доступность              = ПодсказкиАдресов_Использование; 
	Элементы.ПодсказкиАдресов_СоздаватьПунктыВЗаказеНаТС.Доступность = ПодсказкиАдресов_Использование;

КонецПроцедуры

#КонецОбласти
